scripts/aerodynamics/drivaerFastback/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    freestream
    {
        type            calculated;
        value           uniform 0;
    }

    wall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    processor
    {
        type            processor;
        value           uniform 0;
    }
}

// ************************************************************************* //
